Австралия/src/Catalogs/FinancialReportsItems/FinancialReportsItems.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>FinancialReportsItems</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.FinancialReportsTypes</owners>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>EnumRef.FinancialReportItemsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrinting</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReverseSign</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalFilter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>HasSettings</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AnalyticsValue</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>LinkedItem</name>
    <type>
      <types>CatalogRef.FinancialReportsItems</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionForPrintingLanguage4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemTypeAttributes</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.FinancialReportsItemsAttributes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FormulaOperands</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operand</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TableItems</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Column</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalFields</name>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputTitle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InSeparateColumn</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItems</name>
    <attributes>
      <name>Appearance</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceAppliedAreaType</name>
      <type>
        <types>EnumRef.AppearanceAppliedAreasTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedRows</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceAppliedColumns</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AppearanceItemsFilterFieldsDetails</name>
    <attributes>
      <name>ReportItem</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AppearanceItemKey</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterFieldName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ResourceName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ValuesSources</name>
    <attributes>
      <name>Source</name>
      <type>
        <types>CatalogRef.FinancialReportsItems</types>
      </type>
    </attributes>
    <attributes>
      <name>AddedDocumentValues</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/FinancialReportsItems/Forms/UserDefinedFixedIndicator/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ObjectData = Catalogs.FinancialReportsItems.FormOnCreateAtServer(ThisObject);
	IndicatorName = ObjectData.DescriptionForPrinting;
	Items.GroupAdditionalAttributes.Visible = Parameters.ShowRowCodeAndNote;
	Items.MarkItem.Visible = Parameters.ShowRowCodeAndNote;
	RefreshFormTitle();
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	Catalogs.FinancialReportsItems.FormBeforeWriteAtServer(ThisObject, CurrentObject, Cancel);
	
EndProcedure

&AtClient
Procedure BeforeClose(Cancel, StandardProcessing)
	
	If ValueIsFilled(ItemAddressInTempStorage) Then
		StandardProcessing = False;
	EndIf;
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)
	
	RefreshFormTitle();

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure CommentStartChoice(Item, ChoiceData, StandardProcessing)
	
	CommonClient.ShowCommentEditingForm(
		Item.EditText, 
		ThisObject, 
		"Object.Comment");
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure FinishEditing(Command)
	
	FinancialReportingClient.FinishEditingReportItem(ThisObject);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure RefreshFormTitle()
	
	If ValueIsFilled(Object.Ref) Then
		Title = NStr("en = 'User-defined fixed indicator'; ru = 'Пользовательский фиксированный индикатор';pl = 'Zdefiniowany przez użytkownika stały wskaźnik';es_ES = 'Indicador fijo definido por el usuario';es_CO = 'Indicador fijo definido por el usuario';tr = 'Kullanıcı tanımlı sabit gösterge';it = 'Indicatore fisso definito dall''utente';de = 'Benutzerdefiniertes Festkennzeichen'");
	Else
		Title = NStr("en = 'User-defined fixed indicator (Create)'; ru = 'Пользовательский фиксированный индикатор (создание)';pl = 'Zdefiniowany przez użytkownika stały wskaźnik (Tworzenie)';es_ES = 'Indicador fijo definido por el usuario (Crear)';es_CO = 'Indicador fijo definido por el usuario (Crear)';tr = 'Kullanıcı tanımlı sabit gösterge (Oluştur)';it = 'Indicatore fisso personalizzato (Crea)';de = 'Benutzerdefiniertes Festkennzeichen (Erstellen)'");
	EndIf;
	
EndProcedure

#EndRegion
